In [2]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

In [3]:
dframe = DataFrame({'k1':['X','X','Y','Y','Z'],
                   'k2':['alpha','beta','alpha','beta','alpha'],
                   'dataset1':np.random.randn(5),
                   'dataset2':np.random.randn(5)})
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  0.292414 -1.300355
1  X   beta  0.278542 -1.071576
2  Y  alpha  1.908647 -0.526527
3  Y   beta  0.444129  1.050910
4  Z  alpha  1.763847  0.447782

In [5]:
# k1をキーとして、データをグループにまとめる
group1 = dframe['dataset1'].groupby(dframe['k1'])
group1

In [6]:
# グループごとの平均値を計算
group1.mean()

k1
X    0.285478
Y    1.176388
Z    1.763847
Name: dataset1, dtype: float64

In [8]:
# キーを変える
cities = np.array(['NY','LA','LA','NY','NY'])
month = np.array(['JAN','FEB','JAN','FEB','JAN'])
# それぞれでグループ化する
dframe['dataset1'].groupby([cities, month]).mean()

LA  FEB    0.278542
    JAN    1.908647
NY  FEB    0.444129
    JAN    1.028130
Name: dataset1, dtype: float64

In [9]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  0.292414 -1.300355
1  X   beta  0.278542 -1.071576
2  Y  alpha  1.908647 -0.526527
3  Y   beta  0.444129  1.050910
4  Z  alpha  1.763847  0.447782

In [12]:
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X   0.285478 -1.185966
Y   1.176388  0.262192
Z   1.763847  0.447782

In [13]:
dframe.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha  0.292414 -1.300355
   beta   0.278542 -1.071576
Y  alpha  1.908647 -0.526527
   beta   0.444129  1.050910
Z  alpha  1.763847  0.447782

In [14]:
# 列を指定
dataset2_group = dframe.groupby(['k1','k2'])[['dataset2']]
dataset2_group.mean()

          dataset2
k1 k2
X  alpha -1.300355
   beta  -1.071576
Y  alpha -0.526527
   beta   1.050910
Z  alpha  0.447782

In [15]:
dframe.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [16]:
# イテレートができる
for name,group in dframe.groupby('k1'):
    print(f'This is the {name} group')
    print(group)
    print('\n')

This is the X group
  k1     k2  dataset1  dataset2
0  X  alpha  0.292414 -1.300355
1  X   beta  0.278542 -1.071576


This is the Y group
  k1     k2  dataset1  dataset2
2  Y  alpha  1.908647 -0.526527
3  Y   beta  0.444129  1.050910


This is the Z group
  k1     k2  dataset1  dataset2
4  Z  alpha  1.763847  0.447782

In [17]:
for (k1,k2), group in dframe.groupby(['k1','k2']):
    print(f'Key1 = {k1} Key2 = {k2}')
    print(group)
    print('\n')

Key1 = X Key2 = alpha
  k1     k2  dataset1  dataset2
0  X  alpha  0.292414 -1.300355


Key1 = X Key2 = beta
  k1    k2  dataset1  dataset2
1  X  beta  0.278542 -1.071576


Key1 = Y Key2 = alpha
  k1     k2  dataset1  dataset2
2  Y  alpha  1.908647 -0.526527


Key1 = Y Key2 = beta
  k1    k2  dataset1  dataset2
3  Y  beta  0.444129   1.05091


Key1 = Z Key2 = alpha
  k1     k2  dataset1  dataset2
4  Z  alpha  1.763847  0.447782

In [18]:
gr = dframe.groupby('k1')
gr.get_group('X')

  k1     k2  dataset1  dataset2
0  X  alpha  0.292414 -1.300355
1  X   beta  0.278542 -1.071576

In [20]:
# リストを作ってそれを辞書にする
group_dict = dict(list(dframe.groupby('k1')))
group_dict['X']

  k1     k2  dataset1  dataset2
0  X  alpha  0.292414 -1.300355
1  X   beta  0.278542 -1.071576

In [21]:
# 列方向でも同じことをする
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes,axis=1)))
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0  0.292414 -1.300355
 1  0.278542 -1.071576
 2  1.908647 -0.526527
 3  0.444129  1.050910
 4  1.763847  0.447782, dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}